Ret640/tau/LSkEps/mesh1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.00;
    }




    "(U|T|T[0-9]+|k|epsilon|h)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1e5;

    residualControl
    {
       
        U               1e-5;
        h               1e-7;
        "T[0-9]+"       1e-7;
    }
}

relaxationFactors
{
    equations
    {
        U               0.2;
        p_rgh		0.2;
        h               0.3;
        "T[0-9]+"       0.3;
       "(k|R|epsilon)"   0.5;
    }
}
// ************************************************************************* //
